---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDXFExportAvailable
source: html/453d947e-fa89-e18e-d9f8-1084cf53c63f.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDXFExportAvailable Method

Checks whether the DXF Export functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsDXFExportAvailable()
```

## Returns
True if the DXF Export functionality is available in the installed Revit.

## Remarks
DXF Export requires presence of certain modules that are optional and may not be part of the installed Revit.